Revit 2027 API
ImporterIFC.GetOptions Method
 Gets the collection of named options set by the importer client.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetOptions()
Public Function GetOptions As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetOptions()
member GetOptions : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 The collection of named options.
See Also
Reference
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace